# Используем официальный образ Node.js из Docker Hub.
# 'alpine' - это очень легковесная версия Linux.
FROM node:18-alpine

# Создаем и переходим в рабочую директорию внутри контейнера
WORKDIR /app

# Сначала копируем только package.json и package-lock.json (если есть)
# Это позволяет Docker кэшировать этот слой и не переустанавливать зависимости при каждом изменении кода.
COPY package*.json ./
RUN npm ci --only=production

# Устанавливаем все зависимости
RUN npm install

# Копируем ВЕСЬ остальной код проекта в рабочую директорию контейнера
COPY . .

# Сообщаем Docker, что контейнер слушает на порту 3000.
# (Замени 3000 на порт, который использует твоё приложение).
EXPOSE 5000

# Команда для запуска приложения когда контейнер стартует
CMD ["node", "index.js"]
# ИЛИ, если в package.json есть скрипт "start":
# CMD ["npm", "start"]